app/views/main/show_character.html.erb

<%= @character.name %>
<% @character.quotes.each do |quote| %>
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."character_id" = ?  [["character_id", 1]]