app/controllers/main_controller.rb

SELECT  "characters".* FROM "characters" ORDER BY "characters"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
---
  def home
    # 4 links
    @characters = Character.all

SELECT  "characters".* FROM "characters" WHERE "characters"."name" = ? LIMIT ?  [["name", "devon"], ["LIMIT", 1]]
---
  def show_character
    # pagina van character
    # alle quotes
    @character = Character.find_by_name(params[:character])

SELECT  1 AS one FROM "videos" WHERE "videos"."token" = ? LIMIT ?  [["token", "WMC_-LJ3IkamhnpbEe_A5w"], ["LIMIT", 1]]
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def generator
    # generate unique token
    @token = SecureRandom.urlsafe_base64
    while Video.exists?(token: @token) do
      @token = SecureRandom.urlsafe_base64
    end

    @quote = Quote.find(params[:quote])

SELECT  "videos".* FROM "videos" WHERE "videos"."token" = ? LIMIT ?  [["token", "WMC_-LJ3IkamhnpbEe_A5w"], ["LIMIT", 1]]
---
  def show
    @video = Video.find_by_token(params[:token])

INSERT INTO "videos" ("token", "created_at", "updated_at", "video", "quote_id") VALUES (?, ?, ?, ?, ?)  [["token", "dSedf-jRHvjA9l7_O4expA"], ["created_at", 2016-10-22 04:45:39 UTC], ["updated_at", 2016-10-22 04:45:39 UTC], ["video", "dSedf-jRHvjA9l7_O4expA.webm"], ["quote_id", 1]]
---
  def upload
    puts "PARAMETERS ======================= #{params.inspect}"
    # save to database
    video = Video.new
    file = params[:files]
    token = params[:token]
    file[0].original_filename = "#{token}.webm"
    video.video = file[0]
    video.token = token
    video.quote_id = params[:quote]
    video.save